[{"url":"http://paulgraham.com/say.html","title":"What You Can't Say","highlights":[{"quote":"The most important thing is to be able to think what you want, not to say what you want. ","created_at":1642017356}]},{"url":"https://granta.com/new-voices-henry-marsh/","title":"New Voices: Henry Marsh | Granta Magazine","highlights":[{"quote":"another headstone in that cemetery which the French surgeon Leriche once said all surgeons carry within themselves","created_at":1662214181},{"quote":"Approaching a patient you have damaged makes the handle of the door behind which the patient is lying feel as though it is made of lead","created_at":1662214468}]},{"url":"http://paulgraham.com/worked.html","title":"What I Worked On","highlights":[{"quote":"It's not that unprestigious types of work are good per se. But when you find yourself drawn to some kind of work despite its current lack of prestige, it's a sign both that there's something real to be discovered there, and that you have the right kind of motives. Impure motives are a big danger for the ambitious. If anything is going to lead you astray, it will be the desire to impress people. So while working on things that aren't prestigious doesn't guarantee you're on the right track, it at least guarantees you're not on the most common type of wrong one.","created_at":1622116305}]},{"url":"http://paulgraham.com/greatwork.html","title":"http://paulgraham.com/greatwork.html","highlights":[{"quote":"That's one reason nerds have an advantage in doing great work: they expend little effort on seeming anything. In fact that's basically the definition of a nerd.\nNerds have a kind of innocent boldness that's exactly what you need in doing great work. It's not learned; it's preserved from childhood. ","created_at":1703669209},{"quote":"It's better to be promiscuously curious — to pull a little bit on a lot of threads, and see what happens. Big things start small. The initial versions of big things were often just experiments, or side projects, or talks, which then grew into something bigger. So start lots of small things.\nBeing prolific is underrated. The more different things you try, the greater the chance of discovering something new. Understand, though, that trying lots of things will mean trying lots of things that don't work. You can't have a lot of good ideas without also having a lot of bad ones. [21]","created_at":1708886802},{"quote":"Don't worry if you find you're interested in different things than other people. The stranger your tastes in interestingness, the better. Strange tastes are often strong ones, and a strong taste for work means you'll be productive. And you're more likely to find new things if you're looking where few have looked before.\nOne sign that you're suited for some kind of work is when you like even the parts that other people find tedious or frightening.\nBut fields aren't people; you don't owe them any loyalty. If in the course of working on one thing you discover another that's more exciting, don't be afraid to switch.","created_at":1688757691}]}]